---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyInteger
source: html/30e17933-eb34-95ea-9c51-9473600d9eac.htm
---
# AssetPropertyInteger Methods

Adds a new connected asset attached to this asset property, if it allows it.